app/Http/Controllers/CommonControllerFunctions/UserControllerFunctionality.php

    public static function index($userType)
    {
<<<<<<< HEAD
        $users = User::where('is_admin', false)->with(['permission'])->orderBy('user_name', 'asc')->get();
=======
        if($userType == UserType::getAdmin())
            $users = User::where('type', '!=', UserType::getAdmin())
                ->orderBy('user_name', 'asc')->get();
---
select * from "users" where "type" != 'admin' and "users"."deleted_at" is null order by "user_name" asc